group1 = ['Полякова', 'Криштал', 'Пономаренко', 'Куклина', 'Гилязова', 'Епифанова', 'Латышева', 'Свечкова', 'Королева', 'Федоров']
group2 = ['Балабан', 'Паймина', 'Денисова', 'Лисицына', 'Ескина', 'Алиева', 'Ахмедова', 'Коробова', 'Золова', 'Добродеева']

team = tuple(group1[:5] + group2[:5])

print("Группа 1:", group1)
print("Группа 2:", group2)
print("Спортивная команда:", team)

print("Длина кортежа:", len(team))

sorted_team = sorted(team)
print("Отсортированная команда:", sorted_team)

student = "Иванов"
if student in team:
    count = team.count(student)
    print(f"Студент {student} входит в команду. Его фамилия встречается {count} раз(а).")
else:
    print(f"Студент {student} не входит в команду.")